{
    "1.1": {
        "title": "This specification covers the general requirements for the pressure testing of piping  systems.",
        "subsections": {}
    },
    "1.2": {
        "title": "This specification does not cover the testing of pressure vessels, exchangers, piping in  steam generators and other equipments which are tested in accordance with their  applicable codes and specifications under which they have been built.",
        "subsections": {}
    },
    "1.3": {
        "title": "This specification does not cover the testing of non-metallic systems which shall be  tested in accordance with their manufacturer’s recommendations.",
        "subsections": {}
    },
    "1.4": {
        "title": "If piping system belong to ASME B31.1 Power Piping scope, the piping shall be  pressure tested per FPG Power Piping Specification (FGES-PPI50) and ASME B31.3  code latest edition.",
        "subsections": {}
    },
    "1.5": {
        "title": "When a conflict occurs between this specification and applicable local laws and  regulations, or documents stated in paragraph 2.0, FPCC’s engineer shall be consulted  for the clarification of such conflicts.",
        "subsections": {}
    },
    "2.0": {
        "title": "REFERENCES",
        "subsections": {}
    },
    "2.1": {
        "title": "All plant piping shall be pressure tested per ANSI/ASME B31.3 latest edition, unless  otherwise specified herein.",
        "subsections": {}
    },
    "2.2": {
        "title": "The piping line tables indicating the test medium and pressure shall be used as  reference documents.",
        "subsections": {}
    },
    "2.3": {
        "title": "FGES-T-PPI00 配管共同要求規範",
        "subsections": {}
    },
    "3.0": {
        "title": "GENRAL",
        "subsections": {}
    },
    "3.1": {
        "title": "Pressure testing for piping systems shall be performed under the witness of FPCC  engineer.",
        "subsections": {}
    },
    "3.2": {
        "title": "Pressure testing shall be performed after erection, full mechanical release of the piping  and before equipment is initially commissioned.",
        "subsections": {}
    },
    "3.3": {
        "title": "Pressure testing shall be performed for the piping systems including all welded,  screwed or flanged joints before backfilling, painting, insulating or covering the joints. 3.4 If the piping systems were repaired or modified after the pressure testing, such piping  systems shall be retested.",
        "subsections": {}
    },
    "3.5": {
        "title": "In general, all piping systems shall be pressure tested at a metal temperature of not less  than 2℃.",
        "subsections": {}
    },
    "3.6": {
        "title": "完成各項施工檢查後及試運轉前，每一條管線系統(包含管、管件、法蘭 、閥、 配件等，除非企業及部門規範相關章節內容另有規定)須進行壓力測試以確保密封 性及其機械強度。",
        "subsections": {}
    },
    "3.7": {
        "title": "試壓須採水壓測試，除非符合下列條件才可免除： 1) 水壓測試會造成下面影響 ① 損壞內襯或內部絕緣。 ② 濕度會影響製程造成危險、腐蝕或不可操作性。 ③ 因為水壓測試，需要修改成較大的管線支撐。 ④ 測試期間，由於金屬溫度較低，可能發生脆性斷裂的危險。 2) 氣壓測試會造成下列影響 ① 產生能量積聚在管線系統中，存在不可預期的危險。 ② 測試期間，由於金屬溫度較低，可能發生脆性斷裂的危險。",
        "subsections": {
            "3.7.1": "依據 ASME B31.3 屬於 D 類流體(無毒性/不易燃燒/對人體無害且設計≦ 150psi 及設計溫度≦186℃及流體溫度不可小於-29℃)，業主可自行決定不採 用水壓測試，而以製程流體逐漸加壓到操作壓力，並持壓一段時間以平衡管 線應力；當製程流體為氣體或蒸汽時，應於壓力到達 50%測試壓力或 25 psi(取 小者)進行目視檢查，檢查完成後，持續增加壓力到設計壓力，至少持壓 10 分鐘後檢查管線連接處(含銲道、法蘭…等)是否有洩漏。",
            "3.7.2": "當業主認為水壓測試不可行，可以氣壓測試或氣液測試取代，但應先了解 氣壓測試的危險性。",
            "3.7.3": "因下列原因，業主認為水壓與氣壓測試不可行，但應使用其他替代性測試 取代。"
        }
    },
    "3.8": {
        "title": "其他替代性測試： 當業主認為水壓及氣壓測試不可行時，可採用下列測試取代。 1) 周向銲道、縱向銲道須使用 100%RT 或 100%UT。 2) 其他無法依上述使用 RT 或 UT 檢查的銲道，須使用 PT 或 MT 進行檢查。 3.8.2 已依據相關規範進行撓性分析，確認符合要求。",
        "subsections": {
            "3.8.1": "銲道檢查",
            "3.8.3": "依據 3.9 節進行敏感性洩漏測試合格。"
        }
    },
    "3.9": {
        "title": "敏感性洩漏測試 須依據 ASME BPVC,SECTION V, Article 10,Mandatory Appendix I Bubble  Test-Direct Pressure Technique(氣泡測試-直接壓力法)或敏感性洩漏≧10-3 std  mL/s ，當使用氣泡測試-直接壓力法應符合下列要求： 1) 測試壓力至少需≧15 psi 或 25%設計壓力(取小者)。 2) 壓力應緩慢增加到至少 50%測試壓力或 25psi(取小者)，過程中應檢查是 否洩漏，且應有足夠的持壓時間去平衡管線應力。",
        "subsections": {
            "3.9.1": "應遵守企業 FGES-T-PPI00 配管共同要求規範及本規範之相關氣壓測試的 注意事項。",
            "3.9.2": "測試方法"
        }
    },
    "3.10": {
        "title": "原則上不採用氣壓測試，除非經過工程設計部門、建造部門及製程部門三方協商 評估且需經營主管簽核後才可進行氣壓測試。",
        "subsections": {}
    },
    "3.11": {
        "title": "針對系統管線或大範圍管線氣體試壓，工程部門可參考 ASME PCC-2 內容計算 試氣壓安全距離、衝擊波影響及碎片噴濺等影響，再委請廠處工安人員進行整體 安全風險評估後，在試壓管線旁設置警告標示及預防管線或管件失效對人員或設 備產生危害的安全措施。",
        "subsections": {}
    },
    "4.0": {
        "title": "TEST REQUIREMENTS",
        "subsections": {}
    },
    "4.1": {
        "title": "Test Flow Diagram Pressure test flow diagrams indicating all lines to be pressure tested shall be prepared to  facilitate the grouping of lines for each pressure test. The Test FPCC Piping Engineer  using the latest P&I Diagram and Utility Flow Diagram. The Test Flow Diagram shall  identify: 1) Test block number 2) Test fluid 3) Test pressure 4) Location of isolation valves and test blinds",
        "subsections": {}
    },
    "4.2": {
        "title": "Location of pressurizing points (by field)",
        "subsections": {}
    },
    "4.3": {
        "title": "Test Media A. Water shall generally be used as a testing medium. If the operating fluid or  piping material would be adversely affected by fresh water, a substitute fluid  may be used with the FPCC’s approval. B. Test water for stainless steel piping shall not exceed 25 ppm in chloride  contents that would cause stress corrosion. After pressure testing, all water shall be drained immediately, and the interior of piping systems shall be dried  if required. C. Equipment to be hydrostatically tested shall be carefully examined if austenite  stainless steel components are contained. If so, water used for the test shall be  in compliance with the requirements as stated in Para. 4.2.1.B. D. 不銹鋼配管試水壓後相關吹驅及氮封要求： (1). 新擴建工程之廠用空氣與氮氣管線應規劃先完成配設，以利執行 吹驅及氮封作業。 (2). 管線試水壓後 5 天內須排空並進行吹驅，由業主提供 PA 氣源， 工程單位吹驅達供氣氣源露點溫度以下。 (3). 如試壓後 1 個月內未投入使用，由業主提供氮氣氣源，工程單位 吹驅至氧含量<2%並持壓 0.5kg/cm2 氮封(需裝壓力錶)。 (4). 試壓排空吹驅後排放口須立即封盲；而吹驅後至氮封前，若管線 因其他安裝作業等進行解封之情形，須在完工後一天內進行盲封， 避免下雨或其他因素導致管線有積水或異物進入之虞。 (5). 除非執行有問題，再由業主、工程單位與廠商各案檢討因應對策。 The air to be used for pneumatic testing shall be compressed air from a portable  compressor. However, for instrument air lines or where especially specified, oil  free dry compressed air or an inert gas shall be used. When specified for special  case where water would be harmful, process piping may be subjected to a pneumatic test by using air or nitrogen in lieu of a hydrostatic test. A. Low pressure equipment and piping in water, instrument air plant air and  inert gas (nitrogen, argon, etc.), systems operating at 10.3 barg (150 psig) and 186℃(336℉) or less may be tested, at FPCC’s option, with their respective product at its operating pressure. B. Steam tracing lines from the block valve of trace header to block valve of  steam trap set must be in service test. A. The Contractor shall be responsible for providing all equipment, i.e. pumps,  gauges, blank, etc., necessary to carry out the testing of the pipework systems. Equipment shall be suitable for the range of required test pressures. B. The scale range of the test gauge used shall be suitable for the test pressure. C. Test gauges shall be checked against a standard gauge or dead-weight tester before use or whenever there is reason to believe a true reading is not being  obtained. Such tests shall be witnessed by the FPCC’s inspector.",
        "subsections": {
            "4.3.1": "Hydrostatic Test",
            "4.3.2": "Pneumatic Test",
            "4.3.3": "If the piping is tested pneumatically, the pipe temperature shall not be lower  than 15℃.",
            "4.3.4": "Service Test",
            "4.3.5": "Test Equipment"
        }
    },
    "4.4": {
        "title": "Test Pressures A. The hydrostatic test pressure for internal pressure piping shall not be less  than 1-1/2 times the design pressure, but in no case less than 3kg/cm2g. B. For design temperature above the test temperature, the minimum test pressure shall be calculated by the following formula, except that the value  of St/S shall not exceed 6.5: PT= Where, Pt = minimum hydrostatic pressure in kg/cm2g P = internal design pressure in kg/cm2g St = allowable stress in kg/cm2g at test temperature S = allowable stress in kg/cm2g at design temperature C. If the test pressure as defined in para. 4.3.1.B) above would produce a stress  in excess of the yield strength at the test temperature, the test pressure may  be reduced to the maximum pressure that will not exceed the yield strength  at test temperature. D. Fire fighting piping shall be hydrostatically tested at not less than 13.8  kg/cm2g (200 psig) pressure for 2 hours, or at 3.4 kg/cm2g (50 psig) in excess of the maximum pressure, when the maximum pressure to be maintained in the system is in excess of 10.3 kg/cm2g (150 psig.) A. Lines in vacuum service shall be tested at a minimum pressure of 1.0  kg/cm2g(15 psig) unless otherwise limited to lower pressure by the design. B. Lines in external pressure service shall be subjected to an internal test  pressure of 1.5 times the external differential design pressure, but not less  than 1.0 kg/cm2g (15 psig). C. In jacketed lines, the jacket shall be pressure tested in accordance with  para. 4.3.1.B. on the basis of jacket design pressure. The internal line shall  be pressure tested on the basis of the external or internal design pressure, whichever is critical unless otherwise limited by the engineering design. If the piping is tested pneumatically, the test pressure shall be 110% of the   design pressure, unless otherwise specified. The minimum pneumatic test   pressure shall be 1.0 kg/cm2g (15 psig).",
        "subsections": {
            "4.4.1": "Hydrostatic Testing of Internally Pressured Piping",
            "4.4.2": "Hydrostatic Testing of Externally Pressured Piping",
            "4.4.3": "Pneumatic Testing"
        }
    },
    "5.0": {
        "title": "EXTENT OF TESTING",
        "subsections": {}
    },
    "5.1": {
        "title": "The following equipments and instruments shall not be connected to the piping prior to  the completion of the pressure test :",
        "subsections": {
            "5.1.1": "Rotating machinery such as pumps, turbines and compressors ;",
            "5.1.2": "Expansion bellows, pressure safety valves, rupture discs, flame arrestors, orifice  plates and control valves except welded control valves;",
            "5.1.3": "Equipment lined with castable or other material;",
            "5.1.4": "Instruments such as flow indicators, restriction devices, etc. And instrument  lines;",
            "5.1.5": "Any other designated equipment."
        }
    },
    "5.2": {
        "title": "Lines and systems which are open to the atmosphere, such as drains, vents and open  safety valve discharge shall not be pressure tested. These lines shall be visually  inspected to determine that all joints are tight.",
        "subsections": {}
    },
    "5.3": {
        "title": "Sewer systems shall be tested for water tightness. Whenever possible, testing should be  carried out from manhole to manhole. Short branch drains connected to main sewer  between manholes should be tested as one system with the main sewer.",
        "subsections": {}
    },
    "5.4": {
        "title": "In case where a pipe line being tested extents beyond the battery limit without flanges,  it shall be tested to the first block valve or set of flanges outside the battery limit.",
        "subsections": {}
    },
    "5.5": {
        "title": "If the maximum operating conditions of piping attached to a vessel or other equipment  are the same as those of the vessel, then the piping and vessel may be tested together at  the test pressure of the vessel. However, if the piping may be subjected to different  operating conditions then it shall be isolated and tested separately.",
        "subsections": {}
    },
    "5.6": {
        "title": "Pressurized underground lines, sewer lines or drains not included, shall be  hydrostatically tested, the test pressure to be used shall be as indicated in the line table.",
        "subsections": {}
    },
    "5.7": {
        "title": "The following are usually excluded from hydrostatic testing, and are tested  pneumatically to avoid contamination and/or mechanical damage.",
        "subsections": {
            "5.7.1": "Instrument air lines (with dry air only, if possible);",
            "5.7.2": "Air lines to air-operated valves shall be tested with dry air;",
            "5.7.3": "Very large (usually over 26\") gas, steam, overhead lines or thin wall pipe when  weight of hydrotest liquid would cause over-stress of supporting structures or  pipe wall;",
            "5.7.4": "Piping with linings subject to damage by water.",
            "5.7.5": "Any piping system designated in the isometric drawings or decided addressing  the fluid characteristics",
            "5.7.6": "Each reinforcing pad for pressure opening",
            "5.7.7": "Flare line"
        }
    },
    "6.0": {
        "title": "SYSTEM TESTING",
        "subsections": {}
    },
    "6.1": {
        "title": "General Piping System Testing may be employed to facilitate field hydrostatic testing of piping   system after erection. System testing is defined as the simultaneous pressure testing of  as many entire piping systems as practicable, so that the numbers of individual test are  minimized. Where piping systems are tested, the test pressure shall be measured at the highest possible point in the system to ensure that all joints are exposed to the test   pressure. Care shall be taken to ensure that the specified test pressure is established for   each part of the system so that nothing can be over pressurized (e.g. by static head).",
        "subsections": {}
    },
    "6.2": {
        "title": "Limitations of System Testing Exchangers and vessels with shop tested, may be included in a system test except   where:",
        "subsections": {
            "6.2.1": "The hydrostatic test pressure for the piping attached to equipment is higher than  the manufacture’s test pressure or the recommended test pressure;",
            "6.2.2": "The hydrostatic test pressure at the bottom of erected equipment exceeds the  manufacturer’s test pressure due to the static head of the test medium;",
            "6.2.3": "The hydrostatic test pressure exceeds the manufacturer’s allowable differential  between the shell and tubes of heat exchangers, or exceeds the manufacture’s  test pressure of air coolers;",
            "6.2.4": "Equipment foundations or supports are over loaded if the equipment were filled  with water;",
            "6.2.5": "Large vessels require an unreasonable volume of water to fill them; 6.2.6 The refractory lining of equipment would be damaged by water;",
            "6.2.7": "Equipment is extremely difficult to drain or vent."
        }
    },
    "7.0": {
        "title": "MAXIMUM VALVE PRESSURES",
        "subsections": {}
    },
    "7.1": {
        "title": "Flange and Valve Shell Test Pressures The maximum line test pressure applied to any valve flange or valve body shall be as   per the applicable code to which they are built, or as specified by the vendor. 7.2 Valve Seat Test Pressures The maximum line test pressure applied to any valve seat in a closed position shall be   as per the applicable standard to which the valves are built, or as specified by the   vendor whichever is more stringent.",
        "subsections": {}
    },
    "8.0": {
        "title": "CAUTIONS, PREPARATIONS AND PROCEDURES",
        "subsections": {}
    },
    "8.1": {
        "title": "Cautions A. During hydrostatic or pneumatic testing, care shall be taken not to exceed   test pressure specified in the line table. B. The test pressure during pressurizing shall be read by the pressure gauge   installed at the lowest point of the piping in consideration of the water   head pressure. C. Caution shall be exercised in hydrostatic system testing to assure that   supporting structures and foundations are not overloaded by the simultaneous testing of large size piping with adjacent equipment. D. Procedures shall be established to prevent overpressure of lines and any   connected equipment, and any system under hydrostatic testing shall be   carefully observed with proper precautions. E. Caution shall be exercised that equipment nozzles are not overloaded by   the weight of piping full of water. If necessary, temporary support shall be   prepared. F. For each piping system, an outlet for discharging the pressure in case of   emergency shall be designated and properly marked for that purpose. A. Special safety precautions shall be taken during pneumatic test because of   the hazards of high energy release in the event of a failure. The area shall be   roped off to prevent from the reach of unauthorized personnel during the   pneumatic test. Personnel shall not approach the items under pressure during   that time. B. Pneumatic tests shall not exceed 10.0 kg/cm2g (150 psig), except otherwise  specified. C. Any manifold or temporary spool fabricated for test purposes shall be tested  separately to a pressure not less than 20% above the system pressure prior to  the actual pneumatic piping system test. D. A test relief valve set at 105% of the test pressure and capable of relieving the  quantity of the test pressure source shall be furnished and installed for system  protection.",
        "subsections": {
            "8.1.1": "Hydrostatic Test",
            "8.1.2": "Pneumatic Test"
        }
    },
    "8.2": {
        "title": "Preparations",
        "subsections": {
            "8.2.1": "Before testing, all dirts, welding slags, construction debris or other foreign  matters shall be thoroughly cleaned from the piping. All temporary strainers  shall be installed at designated locations.",
            "8.2.2": "Before applying pressure, all lines in the system to be tested shall be inspected  to assure that all blind flanges, blanks, caps or plugs installed to isolate the  piping system are not included in the test.",
            "8.2.3": "For hydrostatic testing, piping shall be adequately supported using additional  temporary supports where necessary. Spring or counterweight supports on these  lines shall be provided with temporary supplementary supports designed to  carry the full test load.",
            "8.2.4": "Vents shall be provided on piping subject to hydrostatic testing to expel the air  when filling the piping with water. Prior to hydrostatic testing, the piping shall  be checked to confirm that it is free from air pockets, and if necessary,  temporary vents shall be provide to eliminate the air pockets. Similarly, drains  are provided at low points.",
            "8.2.5": "Piping systems containing check valves shall have the source of pressure  located in piping system upstream of the valves, and the point of release  downstream of the valves. If this is not possible, the check valves shall be either  temporarily reversed or the discs or balls shall be removed or locked open. A  proper procedure shall be established for identifying the situation of valves so  that the check valves can be restored to the correct position after test.",
            "8.2.6": "A ll joints, including welds, are to be left uninsulated and exposed for  examination during the test."
        }
    },
    "8.3": {
        "title": "Procedures A. Test pressure shall be supplied by means of pumps or other pressure  sources, which shall be isolated from the system until ready to test and  disconnected immediately after the testing. B. The filling hose from the pressure generator shall be connected to the  lowest drain connection in the system to be tested. The generator shall be  attended by an authorized person during the testing. If the operator or the  inspector leaves the generator for any reason, the generator shall be disconnected from the system. The generator and the system to be tested  shall be provided with separate indicating test gauges. C. Two or more pressure gauges shall be installed so that the test pressure can  be easily read. When the piping system to be tested extends from a low to a  high level, pressure gages shall be installed at both the lowest and the  highest points. The test pressure during a pressure increase shall be read by  the pressure gauge installed at the lowest point of the piping in consideration of the water head pressure. D. The pressure shall be brought up slowly and gradually to allow the piping  to equalize strain during the test, and in stages to allow checking for leaks  and inspection of the equipment. E. The test pressure shall be maintained at least 2 hours for under ground  piping before backfill. If under ground piping was backfilled, the hydrostatic testing pressure shall be maintained at least 24 hours. For A/G piping, the test pressure shall be maintained for least 60 minutes.  Both joints and connections shall be examined for leaks. F. If a pressure test is to be maintained for a certain period, care shall be taken  to ensure that the test medium will not be subject to thermal expansion so  that the piping is not damaged during the test, especially for hydrostatic  test. G. Test blanks shall have a handle extending out from the flange. Minimum  thickness of test blanks shall be in accordance with APPENDIX-1 unless  otherwise specified. The number and the location of the test blanks shall be  recorded. H. During pressure testing of piping, operation of the valves shall be  prohibited and the valves shall be properly marked for that purpose. I. After the hydrostatic test has been completed, the pressure shall be released  so as not to endanger personnel or damage equipment. All water shall be  drained immediately form the line and equipment to prevent the piping  system from being damaged by freezing or thermal expansion. Also, to  prevent a vacuum form forming in the piping, the vents shall be opened  when the water is being drained. On completion of the pressure testing, the  line shall be checked to see that no residual pressure is present. J. After satisfactory completion of hydrostatic testing, the following works  shall be performed except that those items temporarily used will not be  utilized for next work. a. All temporary blinds shall be removed and the system drained. b. All valves, orifice plates, expansion joints, short pieces of piping and  other excluded components shall be re-installed. c. Valves closed for hydrostatic testing shall be opened solely. d. All temporary pipe supports shall be removed. e. Seal welding for test vent plug shall be performed. Pneumatic tests shall be applied to the piping in following stages: A. A minimum of two (2) pressure indicating gauges shall be used. One gauge shall be placed near the lowest point in the test block, and an additional  gauge shall be located at the highest point in the test block. B. The pressure shall be gradually increased until a gauge pressure which is  the lesser or one-half the test pressure or 1.75 kg/cm2g (25 psig) is attained,  at which time a preliminary check for tightness shall be made. C. Next, the pressure shall be increased in increments, each equal to 20% of  test pressure. Each time the pressure shall be held for approximately 10  minutes to allow the piping to equalize strain and to detect leakage by  observing a pressure gauge or recorder located a safe distance away. D. When the pressure has reached 100% test pressure, the strength test  phase begins. The pressure shall be held for a minimum of 60 minutes. During the period, the equipment and piping shall not be  subjected to impact and all personnel shall remain at a safe distance. E. After the above, the pressure shall be lowered to 80% of the strength test  pressure, in order to proceed with the tightness test phase. The pressure shall be 75% of strength test pressure or 100% design pressure, whichever is greater, for ASME Section VIII, Division 2 vessels. F. During the tightness test, all joints and connections shall be checked with  solution film and inspected closely. A soap solution shall be applied to all screwed, welded and flanged joints undergoing the pneumatic pressure test. 1) 初步氣壓測試 執行水壓測試前後，必要時先以≦1.76 Kg/cm2 G(25 psig)低壓空氣測試， 找出主要洩漏點。 2) 若管線業主有特殊要求，例如採惰性氣體(氦氣)測試，則依業主要求條件 測試。The pressure shall be gradually increased",
        "subsections": {
            "8.3.1": "Hydrostatic Test",
            "8.3.2": "Pneumatic Test",
            "8.3.3": "洩漏測試要求"
        }
    },
    "9.0": {
        "title": "TEST RECORDS Upon satisfactory completion of each field pressure testing, records shall be made   including the following information: A. date of test; B. identification of item(s) tested; C. ambient temperature; D. test medium and its temperature; E. required test pressure and actual test pressure; F. location of each leak and statement of disposition; G. record of failures during test and the reason for the failure; H. approval signatures by FPCC’s inspectors.",
        "subsections": {}
    },
    "10.0": {
        "title": "APPENDIX 1. Minimum wall thickness of test blind",
        "subsections": {}
    }
}